Revit 2027 API
BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupied Property
 The feed through lugs is in use by circuit [Element].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FeedThroughLugsIsOccupied { get; }
Public Shared ReadOnly Property FeedThroughLugsIsOccupied As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FeedThroughLugsIsOccupied {
	FailureDefinitionId^ get ();
}
static member FeedThroughLugsIsOccupied : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace